---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Visual.AppearanceAssetEditScope
source: html/e890c820-91e5-bd5e-bbf3-dae89fe0dae6.htm
---
# AppearanceAssetEditScope Members

Constructs a new instance of an AppearanceAssetEditScope.